// Задача 6

Console.Write("Введите число ");
int n = int.Parse(Console.ReadLine());

if(n % 2 == 0)
{
    Console.WriteLine("четное число " + n);
}
else
{
    Console.WriteLine("не четное число!");
}